
-- -----------------------------------------------------------Task 2------------------------------------ 
CREATE DATABASE MyDB;

USE MyDB;

DROP TABLE Task2;


CREATE TABLE Task2(
id INT NOT NULL,
LineItem INT NOT NULL,
ФІО VARCHAR(30),
Оф VARCHAR(20),
№оф INT NOT NULL,
Взвод INT NOT NULL,
ТипОружия VARCHAR(10),
МодельОружия VARCHAR(20),
Оружиє_видал VARCHAR(30),
Звание VARCHAR(30),
Дата_видачи VARCHAR(20),

PRIMARY KEY(id,LineItem)
);


INSERT INTO Task2
(id, LineItem, ФІО, Оф, №оф ,Взвод, ТипОружия, МодельОружия , Оружиє_видал, Звание ,Дата_видачи)
VALUES
(1,1,'Петров В.А.'  ,'оф' ,205  , 222, 'АК'  , '47',  'Буров О.С.,'   ,'майор'        ,'10/01/2022'),
(1,2,'Петров В.А.'  ,'оф' ,205  , 222, 'Глок', '20',  'Рибаков Н.Г.'  ,'майор'        ,'10/01/2022'),
(2,1,'Лодарев П.С.' ,'оф' ,221  , 232, 'АК'  , '47',  'Деребанов В.А.','подполковник' ,'12/01/2022'),
(2,2,'Лодарев П.С.' ,'оф' ,221  , 232, 'Глок', '20',  'Рибаков Н.Г.'  ,'майор'        ,'12/01/2022'),
(3,1,'Леонтьєв К.В.','оф' ,201  , 212, 'АК'  , '47',  'Буров О.С.'    ,'майор'        ,'13/01/2022'),
(3,2,'Леонтьєв К.В.','оф' ,201  , 212, 'Глок', '20',  'Рибаков Н.Г.'  ,'майор'  	  ,'13/01/2022'),
(4,1,'Духов Р.М.'   ,'оф' ,200  ,  0 , 'АК'  , '47',  'Буров О.С.'    ,'майор' 		  ,'20/01/2022');


SELECT * FROM MyDB.Task2;




